{
    "data" : [
        {
            "id": 1,
            "blogCategory": "Featured",
            "blogTitle" : "The mighty nanga parbat",
            "slug": "the-mighty-nanga-parbat",
            "postedOn": "20 June, 2016",
            "author": "Yahya Rehman",
            "blogImage": "https://i.ibb.co/d4PpZZR/IMG-0464.jpg",
            "blogText": "This picture is taken from fairy meadows; a lush meadows in the lap of nanga parbat the killer mountain. Fairy meadows is a heavenly place in the lap of Nanga parbat; the killer mountain. Fairy meadows is a lush meadows surrounded by pine trees. It is one of the most popular and beautiful places to visit in pakistan and for good reasons. With an unobstructed view of the 8,125m beast that is Nanga Parbat, one of the highest mountains in the world, it is considered to be one of the most accessible hikes that will allow you to witness an eight thousander. \n The trip starts at raikot bridge on karakoram highway, from there its a 2 hour exhilarating jeep ride to tattu village. From tattu village its a 2 hour hike to fairy meadows. From fairy meadows you can further trek to beyal camp and nanga parbat base camp. \n It truly is a piece of heaven. I’ve been to fairy meadows 4 times in last 5 years and i dont plan to stop. "
        },
        {
            "id" : 2,
            "blogCategory": "Simple",
            "blogTitle": "Sheosar lake",
            "slug": "sheosar-lake",
            "postedOn": "10 August, 2018",
            "author": "Yahya Rehman",
            "blogImage": "https://i.ibb.co/RCszXth/IMG-8655.jpg",
            "blogText": "Sheosar Lake is situated in deosai national park in gilgit baltistan northern province of pakistan. It is located at an altitude of 13590 feet 4,142 m. Its approximate length is reported to be 2.3 km, width 1.8 km. The lake is accessible through two routes. One is via skardu and the other via astore. The road through skardu can be covered by jeep in few hours, however, if trekked, it can take 2 days time. Second route is from astore. From main Astore town, it takes about 4 hours' jeep travel through a semi-metal road to reach chilm chowki, the last residential area adjacent to the plains. Deosai is the combination of two words Deo - giant and ‘Sai’ - shadow. For centuries, it is believed that this place is haunted by giants, thus the name ‘The Land of the Giants’ came into being. The weather in quite unpredictable here, sometimes it starts snowing in summer. Sunlight and clouds seem to play hide and seek here, with the sun shining one minute, and overcast in next. This area remained uncrossable for ages due to abundance of variety of wildlife here. Icy winds, thunderstorms, and presence of wildlife make it impossible to dwell here even in this age, that’s why Deosai is mostly uninhabited. Deosai is located on the boundary of Karakoram and the western Himalayas, and at no point it is less than 4000 meters above sea level. It remains covered with snow for 8 months. The rest of the year, it hosts a range of beautiful flowers of all hues and colours, but not a single tree is found in this plateau spread over 3000 sq. km."
        },
        {
            "id": 3,
            "blogCategory": "Featured",
            "blogTitle": "Rama meadows",
            "slug": "rama-valley",
            "postedOn": "28 July, 2017",
            "author": "Yahya Rehman",
            "blogImage": "https://i.ibb.co/qrn2X62/IMG-1072-2.jpg",
            "blogText": "Rama Valley is thickly forested with huge pine, cedar, fir and juniper trees. The valley is about 10, 800 feet (3300  m) above sea level and thus is snow covered for 7–8 months of the year. In summer, it becomes lush green; conditions favored by local shepherds. From here one can trek to east side of the Nanga Parbat the world's 9th highest mountain. Rama is near Astore. From raikot bridge its a 3-4 hour drive to astore village.  The valley is popular for camping in the summers. Road towards Rama meadow has now been cemented and tourists can reach there without undue difficulty, however there is an hour and half trek to Rama Lake."
        },
        {
            "id": 4,
            "blogCategory": "Featured",
            "blogTitle": "The magnificant Chitta katha",
            "slug": "magnificant-chitta-katha",
            "postedOn": "25 August, 2019",
            "author": "Yahya Rehman",
            "blogImage": "https://i.ibb.co/W0jLqyX/IMG-0340.jpg",
            "blogText": "Chitta katha lake is located in shounter valley, azad kasmir at the elevation of 13,500 feet (4100 m). Chitta katha means white stream; it is the local name of the stream coming down from the hari parbat originating from the lake called chitta katha sar or lake of mount hari parbat. The mountain is sacred for some people who relate it to lord shiva and consider it abode of the lord. The lake is accessible from kel by a 20 kilometer jeep track and 5 kilometer hiking trek. I’ve done a lot of treks but chitta katha trek is my favourite. It offers all the elements from green grass & wild flowers to water streams & waterfalls; from snow-clad mountains to lakes to wild marmots squeaking in the background. "
        },
        {
            "id": 5,
            "blogCategory": "Top",
            "blogTitle": "Heaven on earth, Saral",
            "slug": "heaven-on-earth-saral",
            "postedOn": "5 September, 2019",
            "author": "Yahya Rehman",
            "blogImage": "https://i.ibb.co/2vPvNQF/IMG-1624-Pano-Pano.jpg",
            "blogText": "Saral lake and the surrounding area is a place outside of this world. Saral is located in neelum valley at an altitude of 13,600 feet (4100 m). The lake is accessible from sharda and also naran. Saral lake is a huge beautiful and pristine lake. There are big boulders on the left side and the surroundings are filled with redish/pinkish flowers which is a trademark of kaghan and neelum valleys. The water stream saral lake flows down into another small hidden lake which is known as kunda sar lake to locals. Huge boulders, marmots and pink flowers make this place a piece of heaven.  The best thing about saral lake is that so far it is safe from human interference unlike ratti gali or some other more known accessible lakes.  Though the trek to this lake is a tough one as you have to go through one of the high mountain passes leading to it but the effort is totally worth it.  We did the trek from naran side. From naran a 1.5 hr jeep ride to besal. From besal it takes about 4-5 hrs to reach mullah ki basti. From mullahi ki basti its an 8hr trek to saral. "
        }
    ]
}
